OpenNuvoton/M480BSP/Library/USB_Host/src_core/message.c
    urb = usb_alloc_urb(0, GFP_KERNEL);
    if (!urb)
        return -ENOMEM;

    if ((ep->desc.bmAttributes & USB_ENDPOINT_XFERTYPE_MASK) ==
            USB_ENDPOINT_XFER_INT) {
        pipe = (pipe & ~(0xC0000000)) | (PIPE_INTERRUPT_30);
        usb_fill_int_urb(urb, usb_dev, pipe, data, len,
                         usb_api_blocking_completion, NULL,
                         ep->desc.bInterval);
    } else
        usb_fill_bulk_urb(urb, usb_dev, pipe, data, len,
                          usb_api_blocking_completion, NULL);

    return usb_start_wait_urb(urb, timeout, actual_length);
}

/**
 * usb_get_descriptor - issues a generic GET_DESCRIPTOR request
 * @dev: the device whose descriptor is being retrieved
 * @type: the descriptor type (USB_DT_*)
 * @index: the number of the descriptor
 * @buf: where to put the descriptor
 * @size: how big is "buf"?
 * Context: !in_interrupt ()
 *
 * Gets a USB descriptor.  Convenience functions exist to simplify
 * getting some types of descriptors.  Use
 * usb_get_string() or usb_string() for USB_DT_STRING.
 * Device (USB_DT_DEVICE) and configuration descriptors (USB_DT_CONFIG)
 * are part of the device structure.
 * In addition to a number of USB-standard descriptors, some
 * devices also use class-specific or vendor-specific descriptors.
 *
 * This call is synchronous, and may not be used in an interrupt context.
 *
 * Returns the number of bytes received on success, or else the status code
 * returned by the underlying usb_control_msg() call.
 */
int usb_get_descriptor(struct usb_device *dev, unsigned char type,
                       unsigned char index, void *buf, int size)
{
    int i;
    int result;

    memset(buf, 0, size);   /* Make sure we parse really received data */

    for (i = 0; i < 3; ++i) {
        /* retry on length 0 or error; some devices are flakey */
        result = usb_control_msg(dev, usb_rcvctrlpipe(dev, 0),
                                 USB_REQ_GET_DESCRIPTOR, USB_DIR_IN,
                                 (type << 8) + index, 0, buf, size,
                                 USB_CTRL_GET_TIMEOUT);
        if (result <= 0 && result != -ETIMEDOUT)
            continue;
        if (result > 1 && ((u8 *)buf)[1] != type) {
            result = -ENODATA;
            continue;
        }
        break;
    }
    return result;
}

/**
 * usb_get_string - gets a string descriptor
 * @dev: the device whose string descriptor is being retrieved
 * @langid: code for language chosen (from string descriptor zero)
 * @index: the number of the descriptor
 * @buf: where to put the string
 * @size: how big is "buf"?
 * Context: !in_interrupt ()
 *
 * Retrieves a string, encoded using UTF-16LE (Unicode, 16 bits per character,
 * in little-endian byte order).
 * The usb_string() function will often be a convenient way to turn
 * these strings into kernel-printable form.
 *
 * Strings may be referenced in device, configuration, interface, or other
 * descriptors, and could also be used in vendor-specific ways.
 *
 * This call is synchronous, and may not be used in an interrupt context.
 *
 * Returns the number of bytes received on success, or else the status code
 * returned by the underlying usb_control_msg() call.
 */
static int usb_get_string(struct usb_device *dev, unsigned short langid,
                          unsigned char index, void *buf, int size)
{
    int i;
    int result;

    for (i = 0; i < 3; ++i) {
        /* retry on length 0 or stall; some devices are flakey */
        result = usb_control_msg(dev, usb_rcvctrlpipe(dev, 0),
                                 USB_REQ_GET_DESCRIPTOR, USB_DIR_IN,
                                 (USB_DT_STRING << 8) + index, langid, buf, size,
                                 USB_CTRL_GET_TIMEOUT);
        if (result == 0 || result == -EPIPE)
            continue;
        if (result > 1 && ((u8 *) buf)[1] != USB_DT_STRING) {
            result = -ENODATA;
            continue;
        }
        break;
    }
    return result;
}

#if 0
static void usb_try_string_workarounds(unsigned char *buf, int *length)
{
    int newlength, oldlength = *length;

    for (newlength = 2; newlength + 1 < oldlength; newlength += 2)
        if (!isprint(buf[newlength]) || buf[newlength + 1])
            break;

    if (newlength > 2) {
        buf[0] = newlength;
        *length = newlength;
    }
}
#endif
static int usb_string_sub(struct usb_device *dev, unsigned int langid,
                          unsigned int index, unsigned char *buf)
{
    int rc;

    /* Try to read the string descriptor by asking for the maximum
     * possible number of bytes */
    //if (dev->quirks & USB_QUIRK_STRING_FETCH_255)
    //  rc = -EIO;
    //else
    rc = usb_get_string(dev, langid, index, buf, 255);

    /* If that failed try to read the descriptor length, then
     * ask for just that many bytes */
    if (rc < 2) {
        rc = usb_get_string(dev, langid, index, buf, 2);
        if (rc == 2)
            rc = usb_get_string(dev, langid, index, buf, buf[0]);
    }

    if (rc >= 2) {
        //if (!buf[0] && !buf[1])
        //  usb_try_string_workarounds(buf, &rc);

        /* There might be extra junk at the end of the descriptor */
        if (buf[0] < rc)
            rc = buf[0];

        rc = rc - (rc & 1); /* force a multiple of two */
    }

    if (rc < 2)
        rc = (rc < 0 ? rc : -EINVAL);

    return rc;
}

static int usb_get_langid(struct usb_device *dev, unsigned char *tbuf)
{
    int err;

    if (dev->have_langid)
        return 0;

    if (dev->string_langid < 0)
        return -EPIPE;

    err = usb_string_sub(dev, 0, 0, tbuf);

    /* If the string was reported but is malformed, default to english
     * (0x0409) */
    if (err == -ENODATA || (err > 0 && err < 4)) {
        dev->string_langid = 0x0409;
        dev->have_langid = 1;
        USB_error("string descriptor 0 malformed (err = %d), defaulting to 0x%04x\n",
                  err, dev->string_langid);
        return 0;
    }

    /* In case of all other errors, we assume the device is not able to
     * deal with strings at all. Set string_langid to -1 in order to
     * prevent any string to be retrieved from the device */
    if (err < 0) {
        USB_error("string descriptor 0 read error: %d\n", err);
        dev->string_langid = -1;
        return -EPIPE;
    }

    /* always use the first langid listed */
    dev->string_langid = tbuf[2] | (tbuf[3] << 8);
    dev->have_langid = 1;
    USB_debug("default language 0x%04x\n", dev->string_langid);
    return 0;
}

/**
 * usb_string - returns UTF-8 version of a string descriptor
 * @dev: the device whose string descriptor is being retrieved
 * @index: the number of the descriptor
 * @buf: where to put the string
 * @size: how big is "buf"?
 * Context: !in_interrupt ()
 *
 * This converts the UTF-16LE encoded strings returned by devices, from
 * usb_get_string_descriptor(), to null-terminated UTF-8 encoded ones
 * that are more usable in most kernel contexts.  Note that this function
 * chooses strings in the first language supported by the device.
 *
 * This call is synchronous, and may not be used in an interrupt context.
 *
 * Returns length of the string (>= 0) or usb_control_msg status (< 0).
 */
int usb_string(struct usb_device *dev, int index, char *buf, size_t size)
{
    unsigned char *tbuf;
    int err;

    if (dev->state == USB_STATE_SUSPENDED)
        return -EHOSTUNREACH;
    if ((int)size <= 0 || !buf || !index)
        return -EINVAL;
    buf[0] = 0;
    tbuf = kmalloc(256, GFP_NOIO);
    if (!tbuf)
        return -ENOMEM;

    err = usb_get_langid(dev, tbuf);
    if (err < 0)
        goto errout;

    err = usb_string_sub(dev, dev->string_langid, index, tbuf);
    if (err < 0)
        goto errout;

    size--;     /* leave room for trailing NULL char in output buffer */
    //err = utf16s_to_utf8s((wchar_t *) &tbuf[2], (err - 2) / 2,
    //      UTF16_LITTLE_ENDIAN, buf, size);
    buf[err] = 0;

    if (tbuf[1] != USB_DT_STRING)
        USB_debug("wrong descriptor type %02x for string %d (\"%s\")\n", tbuf[1], index, buf);

errout:
    kfree(tbuf);
    return err;
}

