OpenNuvoton/M480BSP/Library/USB_Host/src_core/message.c
/* one UTF-8-encoded 16-bit character has at most three bytes */
#define MAX_USB_STRING_SIZE (127 * 3 + 1)

/**
 * usb_cache_string - read a string descriptor and cache it for later use
 * @udev: the device whose string descriptor is being read
 * @index: the descriptor index
 *
 * Returns a pointer to a kmalloc'ed buffer containing the descriptor string,
 * or NULL if the index is 0 or the string could not be read.
 */
char *usb_cache_string(struct usb_device *udev, int index)
{
    char *buf;
    char *smallbuf = NULL;
    int len;

    if (index <= 0)
        return NULL;

    buf = kmalloc(MAX_USB_STRING_SIZE, GFP_NOIO);
    if (buf) {
        len = usb_string(udev, index, buf, MAX_USB_STRING_SIZE);
        if (len > 0) {
            smallbuf = kmalloc(++len, GFP_NOIO);
            if (!smallbuf)
                return buf;
            memcpy(smallbuf, buf, len);
        }
        kfree(buf);
    }
    return smallbuf;
}


#ifdef DUMP_DESCRIPTOR
static void  dump_device_descriptor(struct usb_device_descriptor *desc)
{
    printf("\n[Device Descriptor]\n");
    printf("----------------------------------------------\n");
    printf("  Length              = %2d\n",  desc->bLength);
    printf("  DescriptorType      = %02x\n", desc->bDescriptorType);
    printf("  USB version         = %x.%02x\n",
           desc->bcdUSB >> 8, desc->bcdUSB & 0xff);
    printf("  Vendor:Product      = %04x:%04x\n",
           desc->idVendor, desc->idProduct);
    printf("  MaxPacketSize0      = %d\n",   desc->bMaxPacketSize0);
    printf("  NumConfigurations   = %d\n",   desc->bNumConfigurations);
    printf("  Device version      = %x.%02x\n",
           desc->bcdDevice >> 8, desc->bcdDevice & 0xff);
    printf("  Device Class:SubClass:Protocol = %02x:%02x:%02x\n",
           desc->bDeviceClass, desc->bDeviceSubClass, desc->bDeviceProtocol);
}
#endif

/*
 * usb_get_device_descriptor - (re)reads the device descriptor (usbcore)
 * @dev: the device whose device descriptor is being updated
 * @size: how much of the descriptor to read
 * Context: !in_interrupt ()
 *
 * Updates the copy of the device descriptor stored in the device structure,
 * which dedicates space for this purpose.
 *
 * Not exported, only for use by the core.  If drivers really want to read
 * the device descriptor directly, they can call usb_get_descriptor() with
 * type = USB_DT_DEVICE and index = 0.
 *
 * This call is synchronous, and may not be used in an interrupt context.
 *
 * Returns the number of bytes received on success, or else the status code
 * returned by the underlying usb_control_msg() call.
 */
int usb_get_device_descriptor(struct usb_device *dev, unsigned int size)
{
    struct usb_device_descriptor *desc;
    int ret;

    if (size > sizeof(*desc))
        return -EINVAL;
    desc = kmalloc(sizeof(*desc), GFP_NOIO);
    if (!desc)
        return -ENOMEM;

    ret = usb_get_descriptor(dev, USB_DT_DEVICE, 0, desc, size);
    if (ret >= 0)
        memcpy(&dev->descriptor, desc, size);

#ifdef DUMP_DESCRIPTOR
    dump_device_descriptor(desc);
#endif

    kfree(desc);
    return ret;
}

/**
 * usb_get_status - issues a GET_STATUS call
 * @dev: the device whose status is being checked
 * @type: USB_RECIP_*; for device, interface, or endpoint
 * @target: zero (for device), else interface or endpoint number
 * @data: pointer to two bytes of bitmap data
 * Context: !in_interrupt ()
 *
 * Returns device, interface, or endpoint status.  Normally only of
 * interest to see if the device is self powered, or has enabled the
 * remote wakeup facility; or whether a bulk or interrupt endpoint
 * is halted ("stalled").
 *
 * Bits in these status bitmaps are set using the SET_FEATURE request,
 * and cleared using the CLEAR_FEATURE request.  The usb_clear_halt()
 * function should be used to clear halt ("stall") status.
 *
 * This call is synchronous, and may not be used in an interrupt context.
 *
 * Returns the number of bytes received on success, or else the status code
 * returned by the underlying usb_control_msg() call.
 */
int usb_get_status(struct usb_device *dev, int type, int target, void *data)
{
    int ret;
    u16 *status;

    status = kmalloc(sizeof(*status), GFP_KERNEL);

    if (!status)
        return -ENOMEM;

    ret = usb_control_msg(dev, usb_rcvctrlpipe(dev, 0),
                          USB_REQ_GET_STATUS, USB_DIR_IN | type, 0, target, status,
                          sizeof(*status), USB_CTRL_GET_TIMEOUT);

    *(u16 *)data = *status;
    kfree(status);
    return ret;
}

/**
 * usb_clear_halt - tells device to clear endpoint halt/stall condition
 * @dev: device whose endpoint is halted
 * @pipe: endpoint "pipe" being cleared
 * Context: !in_interrupt ()
 *
 * This is used to clear halt conditions for bulk and interrupt endpoints,
 * as reported by URB completion status.  Endpoints that are halted are
 * sometimes referred to as being "stalled".  Such endpoints are unable
 * to transmit or receive data until the halt status is cleared.  Any URBs
 * queued for such an endpoint should normally be unlinked by the driver
 * before clearing the halt condition, as described in sections 5.7.5
 * and 5.8.5 of the USB 2.0 spec.
 *
 * Note that control and isochronous endpoints don't halt, although control
 * endpoints report "protocol stall" (for unsupported requests) using the
 * same status code used to report a true stall.
 *
 * This call is synchronous, and may not be used in an interrupt context.
 *
 * Returns zero on success, or else the status code returned by the
 * underlying usb_control_msg() call.
 */
int usb_clear_halt(struct usb_device *dev, int pipe)
{
    int result;
    int endp;

    endp = usb_pipeendpoint(pipe);

    if (usb_pipein(pipe))
        endp |= USB_DIR_IN;

    /* we don't care if it wasn't halted first. in fact some devices
     * (like some ibmcam model 1 units) seem to expect hosts to make
     * this request for iso endpoints, which can't halt!
     */
    result = usb_control_msg(dev, usb_sndctrlpipe(dev, 0),
                             USB_REQ_CLEAR_FEATURE, USB_RECIP_ENDPOINT,
                             USB_ENDPOINT_HALT, endp, NULL, 0,
                             USB_CTRL_SET_TIMEOUT);

    /* don't un-halt or force to DATA0 except on success */
    if (result < 0)
        return result;

    /* NOTE:  seems like Microsoft and Apple don't bother verifying
     * the clear "took", so some devices could lock up if you check...
     * such as the Hagiwara FlashGate DUAL.  So we won't bother.
     *
     * NOTE:  make sure the logic here doesn't diverge much from
     * the copy in usb-storage, for as long as we need two copies.
     */

