OpenNuvoton/M480BSP/Library/USB_Host/src_core/message.c
    usb_reset_endpoint(dev, endp);

    return 0;
}

static int create_intf_ep_devs(struct usb_interface *intf)
{
    struct usb_device *udev;
    struct usb_host_interface *alt;
    int i;

    udev = interface_to_usbdev(intf);
    alt = intf->cur_altsetting;

    if (intf->ep_devs_created || intf->unregistering)
        return 0;

    for (i = 0; i < alt->desc.bNumEndpoints; ++i)
        (void) usb_create_ep_devs(&intf->dev, &alt->endpoint[i], udev);
    intf->ep_devs_created = 1;
    return 0;
}

static void remove_intf_ep_devs(struct usb_interface *intf)
{
    struct usb_host_interface *alt;
    int i;

    alt = intf->cur_altsetting;

    if (!intf->ep_devs_created)
        return;

    for (i = 0; i < alt->desc.bNumEndpoints; ++i)
        usb_remove_ep_devs(&alt->endpoint[i]);
    intf->ep_devs_created = 0;
}

/**
 * usb_disable_endpoint -- Disable an endpoint by address
 * @dev: the device whose endpoint is being disabled
 * @epaddr: the endpoint's address.  Endpoint number for output,
 *  endpoint number + USB_DIR_IN for input
 * @reset_hardware: flag to erase any endpoint state stored in the
 *  controller hardware
 *
 * Disables the endpoint for URB submission and nukes all pending URBs.
 * If @reset_hardware is set then also deallocates hcd/hardware state
 * for the endpoint.
 */
void usb_disable_endpoint(struct usb_device *dev, unsigned int epaddr,
                          bool reset_hardware)
{
    unsigned int epnum;
    struct usb_host_endpoint *ep;

    epnum = epaddr & USB_ENDPOINT_NUMBER_MASK;

    if (!dev)
        return;

    if (usb_endpoint_out(epaddr)) {
        ep = dev->ep_out[epnum];
        if (reset_hardware)
            dev->ep_out[epnum] = NULL;
    } else {
        ep = dev->ep_in[epnum];
        if (reset_hardware)
            dev->ep_in[epnum] = NULL;
    }
    if (ep) {
        ep->enabled = 0;
        usb_hcd_flush_endpoint(dev, ep);
        if (reset_hardware)
            usb_hcd_disable_endpoint(dev, ep);
    }
}

/**
 * usb_reset_endpoint - Reset an endpoint's state.
 * @dev: the device whose endpoint is to be reset
 * @epaddr: the endpoint's address.  Endpoint number for output,
 *  endpoint number + USB_DIR_IN for input
 *
 * Resets any host-side endpoint state such as the toggle bit,
 * sequence number or current window.
 */
void usb_reset_endpoint(struct usb_device *dev, unsigned int epaddr)
{
    unsigned int epnum;
    struct usb_host_endpoint *ep;

    epnum = epaddr & USB_ENDPOINT_NUMBER_MASK;

    if (usb_endpoint_out(epaddr))
        ep = dev->ep_out[epnum];
    else
        ep = dev->ep_in[epnum];
    if (ep)
        usb_hcd_reset_endpoint(dev, ep);
}


/**
 * usb_disable_interface -- Disable all endpoints for an interface
 * @dev: the device whose interface is being disabled
 * @intf: pointer to the interface descriptor
 * @reset_hardware: flag to erase any endpoint state stored in the
 *  controller hardware
 *
 * Disables all the endpoints for the interface's current altsetting.
 */
void usb_disable_interface(struct usb_device *dev, struct usb_interface *intf,
                           bool reset_hardware)
{
    struct usb_host_interface *alt;
    int i;

    alt = intf->cur_altsetting;

    for (i = 0; i < alt->desc.bNumEndpoints; ++i) {
        usb_disable_endpoint(dev,
                             alt->endpoint[i].desc.bEndpointAddress,
                             reset_hardware);
    }
}

/**
 * usb_disable_device - Disable all the endpoints for a USB device
 * @dev: the device whose endpoints are being disabled
 * @skip_ep0: 0 to disable endpoint 0, 1 to skip it.
 *
 * Disables all the device's endpoints, potentially including endpoint 0.
 * Deallocates hcd/hardware state for the endpoints (nuking all or most
 * pending urbs) and usbcore state for the interfaces, so that usbcore
 * must usb_set_configuration() before any interfaces could be used.
 *
 * Must be called with hcd->bandwidth_mutex held.
 */
void usb_disable_device(struct usb_device *dev, int skip_ep0)
{
    int i;
    struct usb_hcd *hcd;

    hcd = bus_to_hcd(dev->bus);

    /* getting rid of interfaces will disconnect
     * any drivers bound to them (a key side effect)
     */
    if (dev->actconfig) {
        /*
         * FIXME: In order to avoid self-deadlock involving the
         * bandwidth_mutex, we have to mark all the interfaces
         * before unregistering any of them.
         */
        for (i = 0; i < dev->actconfig->desc.bNumInterfaces; i++)
            dev->actconfig->interface[i]->unregistering = 1;

        for (i = 0; i < dev->actconfig->desc.bNumInterfaces; i++) {
            struct usb_interface    *interface;

            /* remove this interface if it has been registered */
            interface = dev->actconfig->interface[i];
            //if (!device_is_registered(&interface->dev))
            //  continue;
            USB_debug("unregistering interface %d\n", interface->cur_altsetting->desc.bInterfaceNumber);
            remove_intf_ep_devs(interface);
            //device_del(&interface->dev);
#if 1   // Nuvoton port, for disconnect device 
            usb_forced_unbind_intf(interface);
            kfree(interface->dev.p);
#endif
        }

        /* Now that the interfaces are unbound, nobody should
         * try to access them.
         */
        for (i = 0; i < dev->actconfig->desc.bNumInterfaces; i++) {
            //put_device(&dev->actconfig->interface[i]->dev);
            kfree(dev->actconfig->interface[i]);
            dev->actconfig->interface[i] = NULL;
        }
        dev->actconfig = NULL;
        if (dev->state == USB_STATE_CONFIGURED)
            usb_set_device_state(dev, USB_STATE_ADDRESS);
    }

    USB_debug("%s unlink %s URBs\n", __func__, skip_ep0 ? "non-ep0" : "all");
    if (hcd->driver->check_bandwidth) {
        /* First pass: Cancel URBs, leave endpoint pointers intact. */
        for (i = skip_ep0; i < 16; ++i) {
            usb_disable_endpoint(dev, i, false);
            usb_disable_endpoint(dev, i + USB_DIR_IN, false);
        }
        /* Remove endpoints from the host controller internal state */
        usb_hcd_alloc_bandwidth(dev, NULL, NULL, NULL);
        /* Second pass: remove endpoint pointers */
    }
    for (i = skip_ep0; i < 16; ++i) {
        usb_disable_endpoint(dev, i, true);
        usb_disable_endpoint(dev, i + USB_DIR_IN, true);
    }
}

/**
 * usb_enable_endpoint - Enable an endpoint for USB communications
 * @dev: the device whose interface is being enabled
 * @ep: the endpoint
 * @reset_ep: flag to reset the endpoint state
 *
 * Resets the endpoint state if asked, and sets dev->ep_{in,out} pointers.
 * For control endpoints, both the input and output sides are handled.
 */
void usb_enable_endpoint(struct usb_device *dev, struct usb_host_endpoint *ep,
                         bool reset_ep)
{
    int epnum;
    int is_out;
    int is_control;

    epnum = usb_endpoint_num(&ep->desc);
    is_out = usb_endpoint_dir_out(&ep->desc);
    is_control = usb_endpoint_xfer_control(&ep->desc);

    USB_vdebug("usb_enable_endpoint - epnum=%d, is_control=%d\n", epnum, is_control);

    if (reset_ep)
        usb_hcd_reset_endpoint(dev, ep);
    if (is_out || is_control)
        dev->ep_out[epnum] = ep;
    if (!is_out || is_control)
        dev->ep_in[epnum] = ep;
    ep->enabled = 1;
}

/**
 * usb_enable_interface - Enable all the endpoints for an interface
 * @dev: the device whose interface is being enabled
 * @intf: pointer to the interface descriptor
 * @reset_eps: flag to reset the endpoints' state
 *
 * Enables all the endpoints for the interface's current altsetting.
 */
void usb_enable_interface(struct usb_device *dev,
                          struct usb_interface *intf, bool reset_eps)
{
    struct usb_host_interface *alt;
    int i;

    alt = intf->cur_altsetting;

