OpenNuvoton/M480BSP/Library/USB_Host/src_core/message.c
    USB_vdebug("usb_enable_interface %d\n", alt->desc.bInterfaceNumber);
    for (i = 0; i < alt->desc.bNumEndpoints; ++i)
        usb_enable_endpoint(dev, &alt->endpoint[i], reset_eps);
}

/**
 * usb_set_interface - Makes a particular alternate setting be current
 * @dev: the device whose interface is being updated
 * @interface: the interface being updated
 * @alternate: the setting being chosen.
 * Context: !in_interrupt ()
 *
 * This is used to enable data transfers on interfaces that may not
 * be enabled by default.  Not all devices support such configurability.
 * Only the driver bound to an interface may change its setting.
 *
 * Within any given configuration, each interface may have several
 * alternative settings.  These are often used to control levels of
 * bandwidth consumption.  For example, the default setting for a high
 * speed interrupt endpoint may not send more than 64 bytes per microframe,
 * while interrupt transfers of up to 3KBytes per microframe are legal.
 * Also, isochronous endpoints may never be part of an
 * interface's default setting.  To access such bandwidth, alternate
 * interface settings must be made current.
 *
 * Note that in the Linux USB subsystem, bandwidth associated with
 * an endpoint in a given alternate setting is not reserved until an URB
 * is submitted that needs that bandwidth.  Some other operating systems
 * allocate bandwidth early, when a configuration is chosen.
 *
 * This call is synchronous, and may not be used in an interrupt context.
 * Also, drivers must not change altsettings while urbs are scheduled for
 * endpoints in that interface; all such urbs must first be completed
 * (perhaps forced by unlinking).
 *
 * Returns zero on success, or else the status code returned by the
 * underlying usb_control_msg() call.
 */
int usb_set_interface(struct usb_device *dev, int interface, int alternate)
{
    struct usb_interface *iface;
    struct usb_host_interface *alt;
    //struct usb_hcd *hcd = bus_to_hcd(dev->bus);
    int ret;
    int manual = 0;
    unsigned int epaddr;
    unsigned int pipe;

    if (dev->state == USB_STATE_SUSPENDED)
        return -EHOSTUNREACH;

    iface = usb_ifnum_to_if(dev, interface);
    if (!iface) {
        USB_debug("selecting invalid interface %d\n", interface);
        return -EINVAL;
    }
    if (iface->unregistering)
        return -ENODEV;

    alt = usb_altnum_to_altsetting(iface, alternate);
    if (!alt) {
        USB_error("selecting invalid altsetting %d\n", alternate);
        return -EINVAL;
    }

    /* Make sure we have enough bandwidth for this alternate interface.
     * Remove the current alt setting and add the new alt setting.
     */
    mutex_lock(hcd->bandwidth_mutex);
    ret = usb_hcd_alloc_bandwidth(dev, NULL, iface->cur_altsetting, alt);
    if (ret < 0) {
        USB_debug("Not enough bandwidth for altsetting %d\n", alternate);
        mutex_unlock(hcd->bandwidth_mutex);
        return ret;
    }

    //if (dev->quirks & USB_QUIRK_NO_SET_INTF)
    //  ret = -EPIPE;
    //else
    ret = usb_control_msg(dev, usb_sndctrlpipe(dev, 0),
                          USB_REQ_SET_INTERFACE, USB_RECIP_INTERFACE,
                          alternate, interface, NULL, 0, 5000);

    /* 9.4.10 says devices don't need this and are free to STALL the
     * request if the interface only has one alternate setting.
     */
    if (ret == -EPIPE && iface->num_altsetting == 1) {
        USB_debug("manual set_interface for iface %d, alt %d\n", interface, alternate);
        manual = 1;
    } else if (ret < 0) {
        /* Re-instate the old alt setting */
        usb_hcd_alloc_bandwidth(dev, NULL, alt, iface->cur_altsetting);
        mutex_unlock(hcd->bandwidth_mutex);
        return ret;
    }
    mutex_unlock(hcd->bandwidth_mutex);

    /* FIXME drivers shouldn't need to replicate/bugfix the logic here
     * when they implement async or easily-killable versions of this or
     * other "should-be-internal" functions (like clear_halt).
     * should hcd+usbcore postprocess control requests?
     */

    /* prevent submissions using previous endpoint settings */
    if (iface->cur_altsetting != alt) {
        remove_intf_ep_devs(iface);
        //usb_remove_sysfs_intf_files(iface);
    }
    usb_disable_interface(dev, iface, true);

    iface->cur_altsetting = alt;

    /* If the interface only has one altsetting and the device didn't
     * accept the request, we attempt to carry out the equivalent action
     * by manually clearing the HALT feature for each endpoint in the
     * new altsetting.
     */
    if (manual) {
        int i;

        for (i = 0; i < alt->desc.bNumEndpoints; i++) {
            epaddr = alt->endpoint[i].desc.bEndpointAddress;
            pipe = __create_pipe(dev,
                                 USB_ENDPOINT_NUMBER_MASK & epaddr) |
                   (usb_endpoint_out(epaddr) ?
                    USB_DIR_OUT : USB_DIR_IN);

            usb_clear_halt(dev, pipe);
        }
    }

    /* 9.1.1.5: reset toggles for all endpoints in the new altsetting
     *
     * Note:
     * Despite EP0 is always present in all interfaces/AS, the list of
     * endpoints from the descriptor does not contain EP0. Due to its
     * omnipresence one might expect EP0 being considered "affected" by
     * any SetInterface request and hence assume toggles need to be reset.
     * However, EP0 toggles are re-synced for every individual transfer
     * during the SETUP stage - hence EP0 toggles are "don't care" here.
     * (Likewise, EP0 never "halts" on well designed devices.)
     */
    usb_enable_interface(dev, iface, true);
    if (1) {  // (device_is_registered(&iface->dev)) {
        //  usb_create_sysfs_intf_files(iface);
        create_intf_ep_devs(iface);
    }
    return 0;
}

/**
 * usb_reset_configuration - lightweight device reset
 * @dev: the device whose configuration is being reset
 *
 * This issues a standard SET_CONFIGURATION request to the device using
 * the current configuration.  The effect is to reset most USB-related
 * state in the device, including interface altsettings (reset to zero),
 * endpoint halts (cleared), and endpoint state (only for bulk and interrupt
 * endpoints).  Other usbcore state is unchanged, including bindings of
 * usb device drivers to interfaces.
 *
 * Because this affects multiple interfaces, avoid using this with composite
 * (multi-interface) devices.  Instead, the driver for each interface may
 * use usb_set_interface() on the interfaces it claims.  Be careful though;
 * some devices don't support the SET_INTERFACE request, and others won't
 * reset all the interface state (notably endpoint state).  Resetting the whole
 * configuration would affect other drivers' interfaces.
 *
 * The caller must own the device lock.
 *
 * Returns zero on success, else a negative error code.
 */
int usb_reset_configuration(struct usb_device *dev)
{
    int         i, retval;
    struct usb_host_config  *config;
    //struct usb_hcd *hcd = bus_to_hcd(dev->bus);

    if (dev->state == USB_STATE_SUSPENDED)
        return -EHOSTUNREACH;

    /* caller must have locked the device and must own
     * the usb bus readlock (so driver bindings are stable);
     * calls during probe() are fine
     */

    for (i = 1; i < 16; ++i) {
        usb_disable_endpoint(dev, i, true);
        usb_disable_endpoint(dev, i + USB_DIR_IN, true);
    }

    config = dev->actconfig;
    retval = 0;
    mutex_lock(hcd->bandwidth_mutex);
    /* Make sure we have enough bandwidth for each alternate setting 0 */
    for (i = 0; i < config->desc.bNumInterfaces; i++) {
        struct usb_interface *intf = config->interface[i];
        struct usb_host_interface *alt;

        alt = usb_altnum_to_altsetting(intf, 0);
        if (!alt)
            alt = &intf->altsetting[0];
        if (alt != intf->cur_altsetting)
            retval = usb_hcd_alloc_bandwidth(dev, NULL,
                                             intf->cur_altsetting, alt);
        if (retval < 0)
            break;
    }
    /* If not, reinstate the old alternate settings */
    if (retval < 0) {
reset_old_alts:
        for (i--; i >= 0; i--) {
            struct usb_interface *intf = config->interface[i];
            struct usb_host_interface *alt;

            alt = usb_altnum_to_altsetting(intf, 0);
            if (!alt)
                alt = &intf->altsetting[0];
            if (alt != intf->cur_altsetting)
                usb_hcd_alloc_bandwidth(dev, NULL,
                                        alt, intf->cur_altsetting);
        }
        mutex_unlock(hcd->bandwidth_mutex);
        return retval;
    }
    retval = usb_control_msg(dev, usb_sndctrlpipe(dev, 0),
                             USB_REQ_SET_CONFIGURATION, 0,
                             config->desc.bConfigurationValue, 0,
                             NULL, 0, USB_CTRL_SET_TIMEOUT);
    if (retval < 0)
        goto reset_old_alts;
    mutex_unlock(hcd->bandwidth_mutex);

