OpenNuvoton/M480BSP/Library/USB_Host/src_core/message.c
    /* re-init hc/hcd interface/endpoint state */
    for (i = 0; i < config->desc.bNumInterfaces; i++) {
        struct usb_interface *intf = config->interface[i];
        struct usb_host_interface *alt;

        alt = usb_altnum_to_altsetting(intf, 0);

        /* No altsetting 0?  We'll assume the first altsetting.
         * We could use a GetInterface call, but if a device is
         * so non-compliant that it doesn't have altsetting 0
         * then I wouldn't trust its reply anyway.
         */
        if (!alt)
            alt = &intf->altsetting[0];

        if (alt != intf->cur_altsetting) {
            remove_intf_ep_devs(intf);
            //usb_remove_sysfs_intf_files(intf);
        }
        intf->cur_altsetting = alt;
        usb_enable_interface(dev, intf, true);
        if (1) {  // (device_is_registered(&intf->dev)) {
            //usb_create_sysfs_intf_files(intf);
            create_intf_ep_devs(intf);
        }
    }
    return 0;
}

void usb_release_interface(struct device *dev)
{
    struct usb_interface *intf;
    //struct usb_interface_cache *intfc =
    //      altsetting_to_usb_interface_cache(intf->altsetting);

    intf = to_usb_interface_by_dev(dev);    // to_usb_interface(dev);

    //kref_put(&intfc->ref, usb_release_interface_cache);
    usb_release_interface_cache(NULL);

    kfree(intf);
}

#ifdef  CONFIG_HOTPLUG
static int usb_if_uevent(struct device *dev, struct kobj_uevent_env *env)
{
    struct usb_device *usb_dev;
    struct usb_interface *intf;
    struct usb_host_interface *alt;

    intf = to_usb_interface_by_dev(dev);    // to_usb_interface(dev);
    usb_dev = interface_to_usbdev(intf);
    alt = intf->cur_altsetting;

    if (add_uevent_var(env, "INTERFACE=%d/%d/%d",
                       alt->desc.bInterfaceClass,
                       alt->desc.bInterfaceSubClass,
                       alt->desc.bInterfaceProtocol))
        return -ENOMEM;

    if (add_uevent_var(env,
                       "MODALIAS=usb:"
                       "v%04Xp%04Xd%04Xdc%02Xdsc%02Xdp%02Xic%02Xisc%02Xip%02X",
                       le16_to_cpu(usb_dev->descriptor.idVendor),
                       le16_to_cpu(usb_dev->descriptor.idProduct),
                       le16_to_cpu(usb_dev->descriptor.bcdDevice),
                       usb_dev->descriptor.bDeviceClass,
                       usb_dev->descriptor.bDeviceSubClass,
                       usb_dev->descriptor.bDeviceProtocol,
                       alt->desc.bInterfaceClass,
                       alt->desc.bInterfaceSubClass,
                       alt->desc.bInterfaceProtocol))
        return -ENOMEM;

    return 0;
}

#else

//static int usb_if_uevent(struct device *dev, struct kobj_uevent_env *env)
//{
//  return -ENODEV;
//}
#endif  /* CONFIG_HOTPLUG */

#if 1
struct device_type usb_if_device_type = { "usb_interface"  };
#else
struct device_type usb_if_device_type = {
    .name =     "usb_interface",
    .release =  usb_release_interface,
    .uevent =   usb_if_uevent,
};
#endif

static struct usb_interface_assoc_descriptor *find_iad(struct usb_device *dev,
        struct usb_host_config *config,
        u8 inum)
{
    struct usb_interface_assoc_descriptor *retval = NULL;
    struct usb_interface_assoc_descriptor *intf_assoc;
    int first_intf;
    int last_intf;
    int i;

    for (i = 0; (i < USB_MAXIADS && config->intf_assoc[i]); i++) {
        intf_assoc = config->intf_assoc[i];
        if (intf_assoc->bInterfaceCount == 0)
            continue;

        first_intf = intf_assoc->bFirstInterface;
        last_intf = first_intf + (intf_assoc->bInterfaceCount - 1);
        if (inum >= first_intf && inum <= last_intf) {
            if (!retval)
                retval = intf_assoc;
            else
                USB_error("Interface #%d referenced by multiple IADs\n", inum);
        }
    }

    return retval;
}


/*
 * Internal function to queue a device reset
 *
 * This is initialized into the workstruct in 'struct
 * usb_device->reset_ws' that is launched by
 * message.c:usb_set_configuration() when initializing each 'struct
 * usb_interface'.
 *
 * It is safe to get the USB device without reference counts because
 * the life cycle of @iface is bound to the life cycle of @udev. Then,
 * this function will be ran only if @iface is alive (and before
 * freeing it any scheduled instances of it will have been cancelled).
 *
 * We need to set a flag (usb_dev->reset_running) because when we call
 * the reset, the interfaces might be unbound. The current interface
 * cannot try to remove the queued work as it would cause a deadlock
 * (you cannot remove your work from within your executing
 * workqueue). This flag lets it know, so that
 * usb_cancel_queued_reset() doesn't try to do it.
 *
 * See usb_queue_reset_device() for more details
 */
#if 0
static void __usb_queue_reset_device(struct work_struct *ws)
{
    int rc;
    struct usb_interface *iface =
        container_of(ws, struct usb_interface, reset_ws);
    struct usb_device *udev = interface_to_usbdev(iface);

    rc = usb_lock_device_for_reset(udev, iface);
    if (rc >= 0) {
        iface->reset_running = 1;
        usb_reset_device(udev);
        iface->reset_running = 0;
        usb_unlock_device(udev);
    }
}
#endif


/*
 * usb_set_configuration - Makes a particular device setting be current
 * @dev: the device whose configuration is being updated
 * @configuration: the configuration being chosen.
 * Context: !in_interrupt(), caller owns the device lock
 *
 * This is used to enable non-default device modes.  Not all devices
 * use this kind of configurability; many devices only have one
 * configuration.
 *
 * @configuration is the value of the configuration to be installed.
 * According to the USB spec (e.g. section 9.1.1.5), configuration values
 * must be non-zero; a value of zero indicates that the device in
 * unconfigured.  However some devices erroneously use 0 as one of their
 * configuration values.  To help manage such devices, this routine will
 * accept @configuration = -1 as indicating the device should be put in
 * an unconfigured state.
 *
 * USB device configurations may affect Linux interoperability,
 * power consumption and the functionality available.  For example,
 * the default configuration is limited to using 100mA of bus power,
 * so that when certain device functionality requires more power,
 * and the device is bus powered, that functionality should be in some
 * non-default device configuration.  Other device modes may also be
 * reflected as configuration options, such as whether two ISDN
 * channels are available independently; and choosing between open
 * standard device protocols (like CDC) or proprietary ones.
 *
 * Note that a non-authorized device (dev->authorized == 0) will only
 * be put in unconfigured mode.
 *
 * Note that USB has an additional level of device configurability,
 * associated with interfaces.  That configurability is accessed using
 * usb_set_interface().
 *
 * This call is synchronous. The calling context must be able to sleep,
 * must own the device lock, and must not hold the driver model's USB
 * bus mutex; usb interface driver probe() methods cannot use this routine.
 *
 * Returns zero on success, or else the status code returned by the
 * underlying call that failed.  On successful completion, each interface
 * in the original device configuration has been destroyed, and each one
 * in the new configuration has been probed by all relevant usb device
 * drivers currently known to the kernel.
 */
int usb_set_configuration(struct usb_device *dev, int configuration)
{
    int i, ret;
    struct usb_host_config *cp = NULL;
    struct usb_interface **new_interfaces = NULL;
    //struct usb_hcd *hcd = bus_to_hcd(dev->bus);
    int n, nintf;

    if (dev->authorized == 0 || configuration == -1)
        configuration = 0;
    else {
        for (i = 0; i < dev->descriptor.bNumConfigurations; i++) {
            if (dev->config[i].desc.bConfigurationValue ==
                    configuration) {
                cp = &dev->config[i];
                break;
            }
        }
    }
    if ((!cp && configuration != 0))
        return -EINVAL;

    /* The USB spec says configuration 0 means unconfigured.
     * But if a device includes a configuration numbered 0,
     * we will accept it as a correctly configured state.
     * Use -1 if you really want to unconfigure the device.
     */
    if (cp && configuration == 0)
        USB_error("config 0 descriptor??\n");

    /* Allocate memory for new interfaces before doing anything else,
     * so that if we run out then nothing will have changed. */
    n = nintf = 0;
    if (cp) {
        nintf = cp->desc.bNumInterfaces;
        new_interfaces = kmalloc(nintf * sizeof(*new_interfaces),
                                 GFP_NOIO);
        if (!new_interfaces) {
            USB_error("Out of memory\n");
            return -ENOMEM;
        }

        for (; n < nintf; ++n) {
            new_interfaces[n] = kzalloc(
                                    sizeof(struct usb_interface),
                                    GFP_NOIO);
            if (!new_interfaces[n]) {
                USB_error("Out of memory\n");
                ret = -ENOMEM;
free_interfaces:
                while (--n >= 0)
                    kfree(new_interfaces[n]);
                kfree(new_interfaces);
                return ret;
            }
        }

