OpenNuvoton/M480BSP/Library/USB_Host/src_core/message.c
        i = dev->bus_mA - cp->desc.bMaxPower * 2;
        if (i < 0)
            USB_error("new config #%d exceeds power limit by %dmA\n", configuration, -i);
    }

    /* Wake up the device so we can send it the Set-Config request */
    ret = usb_autoresume_device(dev);
    if (ret)
        goto free_interfaces;

    /* if it's already configured, clear out old state first.
     * getting rid of old interfaces means unbinding their drivers.
     */
    mutex_lock(hcd->bandwidth_mutex);
    if (dev->state != USB_STATE_ADDRESS)
        usb_disable_device(dev, 1); /* Skip ep0 */

    /* Get rid of pending async Set-Config requests for this device */
    cancel_async_set_config(dev);

    /* Make sure we have bandwidth (and available HCD resources) for this
     * configuration.  Remove endpoints from the schedule if we're dropping
     * this configuration to set configuration 0.  After this point, the
     * host controller will not allow submissions to dropped endpoints.  If
     * this call fails, the device state is unchanged.
     */
    ret = usb_hcd_alloc_bandwidth(dev, cp, NULL, NULL);
    if (ret < 0) {
        mutex_unlock(hcd->bandwidth_mutex);
        usb_autosuspend_device(dev);
        goto free_interfaces;
    }

    ret = usb_control_msg(dev, usb_sndctrlpipe(dev, 0),
                          USB_REQ_SET_CONFIGURATION, 0, configuration, 0,
                          NULL, 0, USB_CTRL_SET_TIMEOUT);
    if (ret < 0) {
        /* All the old state is gone, so what else can we do?
         * The device is probably useless now anyway.
         */
        cp = NULL;
    }

    dev->actconfig = cp;
    if (!cp) {
        usb_set_device_state(dev, USB_STATE_ADDRESS);
        usb_hcd_alloc_bandwidth(dev, NULL, NULL, NULL);
        mutex_unlock(hcd->bandwidth_mutex);
        usb_autosuspend_device(dev);
        goto free_interfaces;
    }
    mutex_unlock(hcd->bandwidth_mutex);
    usb_set_device_state(dev, USB_STATE_CONFIGURED);

    /* Initialize the new interface structures and the
     * hc/hcd/usbcore interface/endpoint state.
     */
    for (i = 0; i < nintf; ++i) {
        struct usb_interface_cache *intfc;
        struct usb_interface *intf;
        struct usb_host_interface *alt;

        cp->interface[i] = intf = new_interfaces[i];
        intfc = cp->intf_cache[i];
        intf->altsetting = intfc->altsetting;
        intf->num_altsetting = intfc->num_altsetting;
        intf->intf_assoc = find_iad(dev, cp, i);
        //kref_get(&intfc->ref);

        alt = usb_altnum_to_altsetting(intf, 0);

        /* No altsetting 0?  We'll assume the first altsetting.
         * We could use a GetInterface call, but if a device is
         * so non-compliant that it doesn't have altsetting 0
         * then I wouldn't trust its reply anyway.
         */
        if (!alt)
            alt = &intf->altsetting[0];

        intf->cur_altsetting = alt;
        usb_enable_interface(dev, intf, true);
        intf->dev.parent = &dev->dev;
        intf->dev.driver = NULL;
        intf->dev.bus = &usb_bus_type;
        intf->dev.type = &usb_if_device_type;
        //intf->dev.groups = usb_interface_groups;
        //intf->dev.dma_mask = dev->dev.dma_mask;
        //INIT_WORK(&intf->reset_ws, __usb_queue_reset_device);

        intf->minor = -1;
        //pm_runtime_no_callbacks(&intf->dev);
        //dev_set_name(&intf->dev, "%d-%s:%d.%d",
        //  dev->bus->busnum, dev->devpath,
        //  configuration, alt->desc.bInterfaceNumber);
    }
    kfree(new_interfaces);

    //if (cp->string == NULL &&
    //      !(dev->quirks & USB_QUIRK_CONFIG_INTF_STRINGS))
    cp->string = usb_cache_string(dev, cp->desc.iConfiguration);

    /* Now that all the interfaces are set up, register them
     * to trigger binding of drivers to interfaces.  probe()
     * routines may install different altsettings and may
     * claim() any interfaces not yet bound.  Many class drivers
     * need that: CDC, audio, video, etc.
     */
    for (i = 0; i < nintf; ++i) {
        struct usb_interface *intf;

        intf = cp->interface[i];

        USB_vdebug("adding (config #%d, interface %d)\n",
                   configuration, intf->cur_altsetting->desc.bInterfaceNumber);
        //device_enable_async_suspend(&intf->dev);
        ret = device_add(&intf->dev);
        if (ret != 0) {
            USB_error("device_add --> %d\n", ret);
            continue;
        }
        create_intf_ep_devs(intf);
    }

    usb_autosuspend_device(dev);
    return 0;
}

static LIST_HEAD(set_config_list);
//static DEFINE_SPINLOCK(set_config_lock);

struct set_config_request {
    struct usb_device   *udev;
    int         config;
    //struct work_struct    work;
    struct list_head    node;
};

/* Worker routine for usb_driver_set_configuration() */
//static void driver_set_config_work(struct work_struct *work)
static void driver_set_config_work(struct set_config_request *req)
{
    //struct set_config_request *req =
    //  container_of(work, struct set_config_request, work);
    struct usb_device *udev = req->udev;

    usb_lock_device(udev);
    spin_lock(&set_config_lock);
    list_del(&req->node);
    spin_unlock(&set_config_lock);
    if (req->config >= -1)      /* Is req still valid? */
        usb_set_configuration(udev, req->config);
    usb_unlock_device(udev);
    usb_put_dev(udev);
    kfree(req);
}

/* Cancel pending Set-Config requests for a device whose configuration
 * was just changed
 */
static void cancel_async_set_config(struct usb_device *udev)
{
    struct set_config_request *req;

    spin_lock(&set_config_lock);
#if 0
    list_for_each_entry(req, &set_config_list, node) {
#else
    for (req = list_entry((&set_config_list)->next, struct set_config_request, node);
            &req->node != (&set_config_list);
            req = list_entry(req->node.next, struct set_config_request, node)) {
#endif
        if (req->udev == udev)
            req->config = -999; /* Mark as cancelled */
    }
    spin_unlock(&set_config_lock);
}

/**
 * usb_driver_set_configuration - Provide a way for drivers to change device configurations
 * @udev: the device whose configuration is being updated
 * @config: the configuration being chosen.
 * Context: In process context, must be able to sleep
 *
 * Device interface drivers are not allowed to change device configurations.
 * This is because changing configurations will destroy the interface the
 * driver is bound to and create new ones; it would be like a floppy-disk
 * driver telling the computer to replace the floppy-disk drive with a
 * tape drive!
 *
 * Still, in certain specialized circumstances the need may arise.  This
 * routine gets around the normal restrictions by using a work thread to
 * submit the change-config request.
 *
 * Returns 0 if the request was successfully queued, error code otherwise.
 * The caller has no way to know whether the queued request will eventually
 * succeed.
 */
int usb_driver_set_configuration(struct usb_device *udev, int config)
{
    struct set_config_request *req;

    req = kmalloc(sizeof(*req), GFP_KERNEL);
    if (!req)
        return -ENOMEM;
    req->udev = udev;
    req->config = config;
    //INIT_WORK(&req->work, driver_set_config_work);

    spin_lock(&set_config_lock);
    list_add(&req->node, &set_config_list);
    spin_unlock(&set_config_lock);

    usb_get_dev(udev);
    //schedule_work(&req->work);
    driver_set_config_work(req);
    return 0;
}


/// @endcond HIDDEN_SYMBOLS

